---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BalustersTooClose
source: html/30b90340-0280-ef09-e2b8-be8c364451de.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BalustersTooClose Property

Baluster Separation must be equal to or greater than the Baluster widths.

## Syntax (C#)
```csharp
public static FailureDefinitionId BalustersTooClose { get; }
```